{"pageProps":{"source":{"compiledSource":"var h=Object.defineProperty,u=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(e,n,t)=>n in e?h(e,n,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[n]=t,o=(e,n)=>{for(var t in n||(n={}))r.call(n,t)&&s(e,t,n[t]);if(a)for(var t of a(n))l.call(n,t)&&s(e,t,n[t]);return e},p=(e,n)=>u(e,m(n));var d=(e,n)=>{var t={};for(var i in e)r.call(e,i)&&n.indexOf(i)<0&&(t[i]=e[i]);if(e!=null&&a)for(var i of a(e))n.indexOf(i)<0&&l.call(e,i)&&(t[i]=e[i]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var i=t,{components:e}=i,n=d(i,[\"components\"]);return mdx(MDXLayout,p(o(o({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h2\",null,\"Proficiency for efficiency\"),mdx(\"p\",null,\"As a developer, you're spending most of your time at the keyboard; reading, navigating, modifying and writing code. Just like a carpenter should master his tools, us developers should master ours. The more proficient you can become at speeding up the menial tasks that are repeated many times throughout the day, the more time you can spend on what you actually set out to do: \",mdx(\"strong\",{parentName:\"p\"},\"code\"),\".\"),mdx(\"br\",null),mdx(\"p\",null,\"This post aims to provide some useful starter tips to get more proficient at the above tasks. Wouldn't it be nice if you could stop using your mouse so much?\"),mdx(\"br\",null),mdx(\"p\",null,\"I use a Windows machine, so I'll be specifying \",mdx(\"inlineCode\",{parentName:\"p\"},\"ctrl\"),\" and \",mdx(\"inlineCode\",{parentName:\"p\"},\"alt\"),\" in the post, but most things in VS Code are interchangeable and simply become replaced by \",mdx(\"inlineCode\",{parentName:\"p\"},\"cmd\"),\" and \",mdx(\"inlineCode\",{parentName:\"p\"},\"option\"),\" on a Mac. For those that aren't interchangeable, read on to find out how to efficiently look up keybindings that you might have forgotten.\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Open command palette (\",mdx(\"inlineCode\",{parentName:\"h2\"},\"ctrl\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"shift\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"p\"),\")\"),mdx(\"p\",null,\"If you haven't been using this, you've really been missing out. All of the following tips and tricks in this blog post can be found via this menu.\"),mdx(\"p\",null,`When you enter this key combination, the following window pops up:\n`,mdx(\"img\",o({parentName:\"p\"},{src:\"/images/commandpalette.png\",alt:\"command_palette\"}))),mdx(\"p\",null,\"This menu let's you search for all the actions that you can trigger inside of Visual Studio Code. For example, try searching for \",mdx(\"inlineCode\",{parentName:\"p\"},\"quick fix\"),\" and the next tip in this blog post shows up.\"),mdx(\"br\",null),mdx(\"p\",null,\"This shortcut is one of my most used, it let's me forget keybindings without making me feel bad.\"),mdx(\"br\",null),mdx(\"p\",null,\"Maybe you forgot how to organize imports? Simply search for it and it will be there, including information about the keybinding for that action. Not only can it help you with things that are bound to key combinations, but it can also trigger actions that have no corresponding keybinding.\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Quick open (\",mdx(\"inlineCode\",{parentName:\"h2\"},\"ctrl\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"p\"),\")\"),mdx(\"p\",null,\"Ever click around the file tree? Well, you shouldn't. Once you're familiar with a project, you more or less know what all the files are called. Jump to a file easily by using this keybinding and typing a substring of the file name and your file navigation in Visual Studio Code will speed up by miles.\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Trigger quickFix (\",mdx(\"inlineCode\",{parentName:\"h2\"},\"ctrl\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\".\"),\")\"),mdx(\"p\",null,\"This shortcut triggers a contextual suggestion for actions you can take based on your current cursor placement.\"),mdx(\"p\",null,\"For example, you can add and remove braces to an arrow function:\"),mdx(\"p\",null,mdx(\"img\",o({parentName:\"p\"},{src:\"/images/ctrldot.png\",alt:\"add_braces_arrow_fn\"}))),mdx(\"p\",null,\"This is really useful when you want to add functionality to a one line arrow function defined somewhere in your project.\"),mdx(\"br\",null),mdx(\"p\",null,\"You can do many nice things with this command, try it out every here and there and see what you can find. It can be especially helpful to trigger an import suggestion or to add all required parameters to a React component for example (provided you use \",mdx(\"inlineCode\",{parentName:\"p\"},\"typescript\"),\").\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Remove current line (\",mdx(\"inlineCode\",{parentName:\"h2\"},\"ctrl\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"shift\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"k\"),\")\"),mdx(\"p\",null,\"I find myself using this one maybe too often, but it's really nice being able to delete lines without selecting the text.\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Expand selection (\",mdx(\"inlineCode\",{parentName:\"h2\"},\"alt\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"shift\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"right/left arrow\"),\")\"),mdx(\"p\",null,\"Ever find yourself wanting to select text in between two parentheses? Or between two quotes? Well, this let's you do exactly that. To use it, place your cursor somewhere and try it out. You expand the selection by hitting \",mdx(\"inlineCode\",{parentName:\"p\"},\"right\"),\" in the key combination specified above, or \",mdx(\"inlineCode\",{parentName:\"p\"},\"left\"),\" if you go too far. This is especially great when you want to remove all text inside a block, or rewrite the arguments to a log statement.\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Add selection to next match (\",mdx(\"inlineCode\",{parentName:\"h2\"},\"ctrl\"),\" + \",mdx(\"inlineCode\",{parentName:\"h2\"},\"d\"),\")\"),mdx(\"p\",null,\"This is a keybinding that is more versatile than you might think. What this keybinding does it that it looks for the next match of your current selection, and marks that as well while duplicating your selection box. This is easier to illustrate with an image:\"),mdx(\"p\",null,mdx(\"img\",o({parentName:\"p\"},{src:\"/images/ctrld.png\",alt:\"duplicated_selection\"}))),mdx(\"p\",null,\"Here I marked the word \",mdx(\"inlineCode\",{parentName:\"p\"},\"day\"),\" and hit \",mdx(\"inlineCode\",{parentName:\"p\"},\"ctrl\"),\" + \",mdx(\"inlineCode\",{parentName:\"p\"},\"d\"),\" a bunch of times, this selected all occurrences and I can either replace \",mdx(\"inlineCode\",{parentName:\"p\"},\"day\"),\" with something else just by typing or remove it by hitting delete for example.\"),mdx(\"p\",null,\"This really starts to shine once you can visualize common substrings or parts of text that you wish to manipulate all at once. A common task where this is great is to turn a comma-separated list into a space-separated one for example, or to insert new lines after every space.\"),mdx(\"hr\",null),mdx(\"h2\",null,\"Learn more\"),mdx(\"p\",null,\"I intentionally kept this blog post pretty short, if you try to learn too many keybindings at once you might end up feeling overwhelmed. Try to focus on learning one at a time, once it feels second nature to you, move along and learn another one.\"),mdx(\"br\",null),mdx(\"p\",null,\"If you want some inspiration, open up the command palette and search for \",mdx(\"em\",{parentName:\"p\"},\"Keyboard Shortcuts\"),\" and you'll find an extensive list of built-in keybindings available out of the box in Visual Studio Code.\"),mdx(\"br\",null),mdx(\"p\",null,\"Don't forget, you can always add your own keybindings or rebind the ones that are already present.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"meta":{"title":"A few Visual Studio Code keybindings to improve your efficiency","author":"Simon Nyström","date":"2021-12-27","tags":["webdev","editor","productivity"],"slug":"vscode-tips"}},"__N_SSG":true}