{"pageProps":{"post":{"html":"<p>This post will go through the steps needed to setup a working MongoDB environment inside a Docker container on your local machine. The benefits of having MongoDB inside a container on your local machine is that you can easily change versions and use different MongoDB instances without having to have multiple different versions installed. It also allows you to share your MongoDB setup with your team so that everyone can connect to a similar local database that can be used for testing and development.</p>\n<p>You need to have Docker installed to be able to follow this guide, instructions for this can be found <a href=\"https://docs.docker.com/get-docker/\">here</a>. I am using version <code>2.4.0.0 (48506)</code> at the time of writing.</p>\n<p>Disclaimer: The following approach stores data inside the container itself, meaning that <strong>you will lose all your data if you remove the container!</strong> This is intended to be used for development and testing purposes.</p>\n<hr>\n<h1 id=\"running-the-mongodb-instance\">Running the MongoDB instance</h1>\n<p>It&#39;s surprisingly easy to get this up and running.</p>\n<p>Run the following command from a terminal window:</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>docker run -p27017:27017 --name my-mongodb-container -d mongo:latest</code></pre><p>This will:</p>\n<ul>\n<li>Start the <code>mongo:latest</code> image in a container</li>\n<li>Detach the container <code>-d</code></li>\n<li>Name it <code>my-mongodb-container</code></li>\n<li>Map the container port <code>27017</code> to our own machine&#39;s <code>27017</code></li>\n</ul>\n<p>You can find more tags <a href=\"https://hub.docker.com/_/mongo\">here</a> if you don&#39;t want to use the <code>latest</code> version.</p>\n<hr>\n<h1 id=\"connecting-to-the-mongodb-instance\">Connecting to the MongoDB instance</h1>\n<p>Now that we have a MongoDB container up and running, we can try to connect to it using the following command:</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>docker run -it --rm mongo mongo --host host.docker.internal</code></pre><p>This will:</p>\n<ul>\n<li>Start the <code>mongo</code> image in a container</li>\n<li>Using interactive mode <code>-it</code></li>\n<li>Removing the container once we exit <code>--rm</code></li>\n<li>Run the <code>mongo</code> command inside the container, with the argument <code>--host host.docker.internal</code></li>\n</ul>\n<p>The <code>host.docker.internal</code> address is special and can be used as a workaround to <a href=\"https://docs.docker.com/docker-for-mac/networking/#use-cases-and-workarounds\">connect to the host machine from a container</a>.</p>\n<hr>\n<p>That&#39;s all there is to it. You should be able to go ahead and use this container instance of MongoDB now for local development and testing purposes.</p>\n","date":"2020-10-04","slug":"docker-mongodb-development","title":"Setting up MongoDB in Docker for development","categories":[],"tags":["docker","mongodb"],"summary":"Learn how to setup MongoDB using Docker on your local machine."}},"__N_SSG":true}