{"pageProps":{"post":{"html":"<p>Static websites are all the jam these days and you might have heard about the <a href=\"https://jamstack.org/\">JAMStack</a>. Static sites allow you to host very performant pre-built sites like my example site <a href=\"https://interest.newcurrent.se\">Compound interest calculator</a>. Some popular static site frameworks include <a href=\"https://sapper.svelte.dev/\">Sapper</a> (uses Svelte), <a href=\"https://nextjs.org/\">Next.js</a> and <a href=\"https://www.gatsbyjs.com/\">Gatsby</a> (uses React) and <a href=\"https://vuepress.vuejs.org/\">VuePress</a> (ses Vue). This tutorial will show you how to build and host a static site on Netlify by using a GitHub repository for your code. For this tutorial I will be using Sapper, but any of the frameworks above should do just fine.</p>\n<hr>\n<h1 id=\"project-setup\">Project setup</h1>\n<p>To follow along with the blog you will need to have the following:</p>\n<ul>\n<li><a href=\"https://nodejs.org/en/download/\">Node</a> installed</li>\n<li>A <a href=\"https://github.com/\">GitHub</a> account and an empty repository</li>\n<li>A <a href=\"https://www.netlify.com/\">Netlify</a> account</li>\n<li>A GitHub project with the code for your static site</li>\n<li>Knowledge of how your chosen framework creates bundles ready for static hosting</li>\n</ul>\n<p>Initialize your project with your tool of choice. Since I&#39;m using sapper, it&#39;s done by running the following command:</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>npx degit <span class=\"hljs-string\">&quot;sveltejs/sapper-template#rollup&quot;</span> my-static-site\n<span class=\"hljs-built_in\">cd</span> my-static-site\nnpm install</code></pre><p>Sapper sites are prepared for static site hosting by running the <code>export</code> command like below, (if you aren&#39;t following along with Sapper run whatever is the corresponding built/export command for your chosen site)</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>npm run <span class=\"hljs-built_in\">export</span></code></pre><p>The above step isn&#39;t crucial, but it helps to know that your app can be served statically. To test our exported Sapper app, we can run the following in our terminal (if you&#39;re using another framework, look in the documentation how to serve your site statically):</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>npx serve __sapper__/export</code></pre><p>This will start a local webserver on your computer and it should greet you with something like the following image:</p>\n<p><img src=\"/images/sapper/npx_serve_startup.png\" alt=\"serve start up indicator\"></p>\n<p>Visit the URL in the above notification and make sure your site is served properly.</p>\n<hr>\n<h1 id=\"pushing-our-site-to-github\">Pushing our site to GitHub</h1>\n<p>Now that we&#39;ve made sure our site can be hosted and accessed statically, it&#39;s time to push our site to GitHub to prepare it for release on Netlify.</p>\n<p>Let&#39;s initialize our project directory as a git repository:</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>git init\ngit add .\ngit commit -m <span class=\"hljs-string\">&quot;Initial commit&quot;</span></code></pre><p>I mentioned in the intro that you need will need an empty (don&#39;t initialize it with a README, gitignore or license) GitHub repository. If you don&#39;t have one, go to your <a href=\"https://github.com/\">GitHub account</a> and create a new repository.</p>\n<p>To be able to push our code to GitHub, we need to run the following commands to connect our local repo to the remote. Replace <code>my-username</code> with your GitHub username and <code>my-static-site</code> with the name of your GitHub repo.</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>git remote add origin git@github.com:my-username/my-static-site.git\ngit branch -M main\ngit push -u origin main</code></pre><p>If you refresh your GitHub repository after this, you should see your code there.</p>\n<hr>\n<h1 id=\"deploying-our-site-to-netlify\">Deploying our site to Netlify</h1>\n<p>Log in to your <a href=\"https://www.netlify.com/\">Netlify</a> account and go to the <code>Team overview</code> tab. Here you should see something similar to the image below:</p>\n<p><img src=\"/images/netlify/netlify_sites.png\" alt=\"Netlify sites\"></p>\n<p>All we have to do now is complete the following steps:</p>\n<ol>\n<li>Click on <code>New site from Git</code>, this takes you to a three step process, the first being <code>1. Connect to Git Provider</code></li>\n<li>Click on <code>GitHub</code> under the Continuous Deployment header to proceed</li>\n<li>Go through the Netlify/GitHub auth process and make sure to allow Netlify access to your new repository. This takes you to section <code>2. Pick a repository</code>.</li>\n<li>Select your repository from the list. This takes you to section <code>3. Build options, and deploy!</code>.</li>\n<li>Fill out the information, for Sapper this involves the following settings (follow your chosen frameworks docs for this process if you&#39;re using something else):<ul>\n<li>Owner should be yourself</li>\n<li><code>Branch to deploy</code> should be set to <code>main</code></li>\n<li>Build command should be <code>npm run export</code></li>\n<li>Publish directory should be <code>__sapper__/export</code></li>\n</ul>\n</li>\n<li>Click <code>Deploy site</code>.</li>\n</ol>\n<p>After completing the steps above, you should be sent to a view that looks something like this:</p>\n<p><img src=\"/images/netlify/netlify_built.png\" alt=\"Netlify built\"></p>\n<p>Visiting that URL should take you to your deployed app 😎.</p>\n<hr>\n<h1 id=\"redeploying-our-site-after-updating-it\">Redeploying our site after updating it</h1>\n<p>One of the best things with Netlify is that once we push changes to the <code>main</code> branch, Netlify will build and deploy our project with all the new changes.</p>\n<p>Go ahead and change something in your project and commit and push it to GitHub. Once that&#39;s done you can head over to the <code>Deploys</code> tab on Netlify under your site and see that a new deploy is in progress.</p>\n<p>Once it&#39;s deployed, you can visit your site again and see your changes.</p>\n<hr>\n<h1 id=\"summary\">Summary</h1>\n<p>Hosting your site on Netlify is a great option if you&#39;re just serving static content and you want to get something up and running quickly on the web. Netlify supports a bunch of other features like custom domain names, plugins and analytics that aren&#39;t free and I have yet to try them but I&#39;m impressed so far.</p>\n<p>Feel free to ask any questions. 🙂</p>\n","date":"2020-10-26","slug":"host-static-website-netlify","title":"Host a static website for free using Netlify and GitHub","categories":[],"tags":["svelte","sapper","netlify","javascript"],"summary":"Learn how to host your static website for free by using Sapper, Netlify and GitHub."}},"__N_SSG":true}