{"pageProps":{"post":{"html":"<p>If you often work from different machines or on different projects where you want to be able to share a development environment within the team to ensure consistent use of versions and so on, containerizing your development environment is the way to go.</p>\n<p>This post will go through the needed steps to containerizing your development environment for a Node.js project in Visual Studio Code using Docker.</p>\n<hr>\n<h1 id=\"project-setup\">Project setup</h1>\n<p>To follow along with the blog you will need to have the following:</p>\n<ul>\n<li><a href=\"https://code.visualstudio.com/download\">Visual Studio Code</a> installed</li>\n<li>An empty directory opened in Visual Studio Code</li>\n<li><a href=\"https://docs.docker.com/get-docker/\">Docker</a> installed and perferably some prior knowledge of what Docker is and how it works</li>\n</ul>\n<p>Utilizing a development container easily in Visual Studio Code has another requirement: the plugin <code>ms-vscode-remote.remote-containers</code> provisioned by Microsoft. Go ahead and install this in Visual Studio Code, either earch for it on the marketplace inside the editor or run </p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>code --install-extension ms-vscode-remote.remote-containers</code></pre><p>from the command line.</p>\n<p>Once the extension is installed, you need to reload Visual Studio Code to activate the extension.</p>\n<hr>\n<h1 id=\"your-first-dev-container\">Your first dev container</h1>\n<p>Once you&#39;ve completed the previous step, press the key combination <code>CMD + SHIFT + P</code> (Mac) <code>CTRL + SHIFT + P</code> (Windows) to open the command palette. Type <code>remote-containers</code> and you should be greeted with something similar to the image below:</p>\n<p><img src=\"/images/vscode/command_palette_remote_containers.png\" alt=\"Command palette with remote containers search results\"></p>\n<p>To initialize the devcontainer files, select the <code>Remote-Containers: Add Development Container Configuration Files...</code> option and you will get an extensive list presented to you where you get to pick which predefined container definition to use. Since this example will set up a Node.js project, select the <code>Node.js</code> container definition then pick a version, I went with <code>14</code>. If it doesn&#39;t show up, you might have to search for it and click <code>Show all definitions...</code>.</p>\n<p>If you can&#39;t find the <code>Node.js</code> container definition, you can refer to the <code>.devcontainer</code> folder in the <a href=\"https://github.com/simon-nystrom/devcontainer-example\">repository created for this blog post.</a></p>\n<p>When the step above has been completed, you should have a <code>devcontainer.json</code> file open under the <code>.devcontainer</code> folder. This file is generated and contains some helpful starter options and comments. It looks like this:</p>\n<pre><div class=\"copy-me\" onclick=\"copyCode(this)\">Copy</div><code>{\n    <span class=\"hljs-attr\">&quot;name&quot;</span>: <span class=\"hljs-string\">&quot;Node.js&quot;</span>,\n    <span class=\"hljs-attr\">&quot;build&quot;</span>: {\n        <span class=\"hljs-attr\">&quot;dockerfile&quot;</span>: <span class=\"hljs-string\">&quot;Dockerfile&quot;</span>,\n        <span class=\"hljs-comment\">// Update &#x27;VARIANT&#x27; to pick a Node version: 10, 12, 14</span>\n        <span class=\"hljs-attr\">&quot;args&quot;</span>: { <span class=\"hljs-attr\">&quot;VARIANT&quot;</span>: <span class=\"hljs-string\">&quot;14&quot;</span> }\n    },\n\n    <span class=\"hljs-comment\">// Set *default* container specific settings.json values on container create.</span>\n    <span class=\"hljs-attr\">&quot;settings&quot;</span>: { \n        <span class=\"hljs-attr\">&quot;terminal.integrated.shell.linux&quot;</span>: <span class=\"hljs-string\">&quot;/bin/bash&quot;</span>\n    },\n\n    <span class=\"hljs-comment\">// Add the IDs of extensions you want installed when the container is created.</span>\n    <span class=\"hljs-attr\">&quot;extensions&quot;</span>: [\n        <span class=\"hljs-string\">&quot;dbaeumer.vscode-eslint&quot;</span>\n    ]\n\n    <span class=\"hljs-comment\">// Use &#x27;forwardPorts&#x27; to make a list of ports inside the container available locally.</span>\n    <span class=\"hljs-comment\">// &quot;forwardPorts&quot;: [],</span>\n\n    <span class=\"hljs-comment\">// Use &#x27;postCreateCommand&#x27; to run commands after the container is created.</span>\n    <span class=\"hljs-comment\">// &quot;postCreateCommand&quot;: &quot;yarn install&quot;,</span>\n\n    <span class=\"hljs-comment\">// Uncomment to connect as a non-root user. See https://aka.ms/vscode-remote/containers/non-root.</span>\n    <span class=\"hljs-comment\">// &quot;remoteUser&quot;: &quot;node&quot;</span>\n}</code></pre><p>It is possible that Visual Studio Code noticed the creation of this <code>.devcontainer</code> folder and might now be prompting you in the bottom right corner to reopen the folder to develop in a container. Go ahead and click <code>Reopen in Container</code> if that is the case. Otherwise you might need to do it manually via the command palette like we did when we created the devcontainer earlier, but type and select the <code>Remote-Containers: Open Folder in Container...</code> option and select the current folder.</p>\n<p>You should now be connected to the dev container, indicated in the bottom left like this:</p>\n<p><img src=\"/images/vscode/dev_container.png\" alt=\"Dev container indicator\"></p>\n<p>You might also have noticed that the open folder in the Explorer window has been appended with <code>[DEV CONTAINER: NODE.JS]</code>.</p>\n<p>Now that we&#39;re connected to our dev container, let&#39;s continue by putting it to use and exploring the benefits.</p>\n<hr>\n<h1 id=\"using-the-dev-container\">Using the dev container</h1>\n<p>Our directory isn&#39;t empty anymore since we now have a <code>.devcontainer</code> folder, however, this folder alone is meaningless. Open an integrated terminal inside Visual Studio Code, this can be done by searching for <code>Terminal: Create New Integrated Terminal</code> in the command palette and selecting it. This will open a terminal inside the dev container.</p>\n<p>Now we&#39;re ready to use Node.js inside the container with the version we specified earlier (<code>14</code> in this case):</p>\n<p><img src=\"/images/vscode/node_dev_container.png\" alt=\"Node running inside the dev container\"></p>\n<hr>\n<h1 id=\"summary\">Summary</h1>\n<p>Using dev containers you can easily reproduce your own development environment on other machines or share the development environment with your team. Dev containers even allow you to install container specific extensions such as in the <code>devcontainer.json</code> example earlier where the extension <code>dbaeumer.vscode-eslint</code> is installed in the container.</p>\n<p>A multitude of dev container templates are available various languages/development environments but you can also just as easily create your own by modifying the generated <code>devcontainer.json</code> and <code>Dockerfile</code> files.</p>\n<p>Another major benefit is that your development environment is now easily backed up to a remote file storage or a Git repository. It&#39;s no longer a major hassle to get your computer set up properly if you make sure to always use dev containers. You also no longer have to worry about running differing versions to what was expected/intended for the project.</p>\n<p>For more advanced usages and more information I recommend the following resources:</p>\n<ul>\n<li><a href=\"https://code.visualstudio.com/docs/remote/containers\">Basics</a></li>\n<li><a href=\"https://code.visualstudio.com/docs/remote/containers-advanced\">Advanced usage</a></li>\n<li><a href=\"https://code.visualstudio.com/docs/remote/troubleshooting#_containers-tips\">Tips &amp; Tricks</a></li>\n</ul>\n<hr>\n","date":"2020-10-19","title":"Containerizing your development environment","slug":"containerized-development-environment","summary":"Learn how to containerize your development environment with Docker and Visual Studio Code.","categories":[],"published":true,"tags":["docker","vscode","node","javascript"]}},"__N_SSG":true}